zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lppdma_reg.h
#define LPPDMA_ABTSTS_ABTIF1_Pos         (1)                                               /*!< LPPDMA_T::ABTSTS: ABTIF1 Position      */
#define LPPDMA_ABTSTS_ABTIF1_Msk         (0x1ul << LPPDMA_ABTSTS_ABTIF1_Pos)               /*!< LPPDMA_T::ABTSTS: ABTIF1 Mask          */

#define LPPDMA_ABTSTS_ABTIF2_Pos         (2)                                               /*!< LPPDMA_T::ABTSTS: ABTIF2 Position      */
#define LPPDMA_ABTSTS_ABTIF2_Msk         (0x1ul << LPPDMA_ABTSTS_ABTIF2_Pos)               /*!< LPPDMA_T::ABTSTS: ABTIF2 Mask          */

#define LPPDMA_ABTSTS_ABTIF3_Pos         (3)                                               /*!< LPPDMA_T::ABTSTS: ABTIF3 Position      */
#define LPPDMA_ABTSTS_ABTIF3_Msk         (0x1ul << LPPDMA_ABTSTS_ABTIF3_Pos)               /*!< LPPDMA_T::ABTSTS: ABTIF3 Mask          */

#define LPPDMA_TDSTS_TDIF0_Pos           (0)                                               /*!< LPPDMA_T::TDSTS: TDIF0 Position        */
#define LPPDMA_TDSTS_TDIF0_Msk           (0x1ul << LPPDMA_TDSTS_TDIF0_Pos)                 /*!< LPPDMA_T::TDSTS: TDIF0 Mask            */

#define LPPDMA_TDSTS_TDIF1_Pos           (1)                                               /*!< LPPDMA_T::TDSTS: TDIF1 Position        */
#define LPPDMA_TDSTS_TDIF1_Msk           (0x1ul << LPPDMA_TDSTS_TDIF1_Pos)                 /*!< LPPDMA_T::TDSTS: TDIF1 Mask            */

#define LPPDMA_TDSTS_TDIF2_Pos           (2)                                               /*!< LPPDMA_T::TDSTS: TDIF2 Position        */
#define LPPDMA_TDSTS_TDIF2_Msk           (0x1ul << LPPDMA_TDSTS_TDIF2_Pos)                 /*!< LPPDMA_T::TDSTS: TDIF2 Mask            */

#define LPPDMA_TDSTS_TDIF3_Pos           (3)                                               /*!< LPPDMA_T::TDSTS: TDIF3 Position        */
#define LPPDMA_TDSTS_TDIF3_Msk           (0x1ul << LPPDMA_TDSTS_TDIF3_Pos)                 /*!< LPPDMA_T::TDSTS: TDIF3 Mask            */

#define LPPDMA_ALIGN_ALIGNn_Pos          (0)                                               /*!< LPPDMA_T::ALIGN: ALIGNn Position       */
#define LPPDMA_ALIGN_ALIGNn_Msk          (0xful << LPPDMA_ALIGN_ALIGNn_Pos)                /*!< LPPDMA_T::ALIGN: ALIGNn Mask           */

#define LPPDMA_TACTSTS_TXACTFn_Pos       (0)                                               /*!< LPPDMA_T::TACTSTS: TXACTFn Position    */
#define LPPDMA_TACTSTS_TXACTFn_Msk       (0xful << LPPDMA_TACTSTS_TXACTFn_Pos)             /*!< LPPDMA_T::TACTSTS: TXACTFn Mask        */

#define LPPDMA_CHRST_CHnRST_Pos          (0)                                               /*!< LPPDMA_T::CHRST: CHnRST Position       */
#define LPPDMA_CHRST_CHnRST_Msk          (0xful << LPPDMA_CHRST_CHnRST_Pos)                /*!< LPPDMA_T::CHRST: CHnRST Mask           */

#define LPPDMA_REQSEL0_3_REQSRC0_Pos     (0)                                               /*!< LPPDMA_T::REQSEL0_3: REQSRC0 Position  */
#define LPPDMA_REQSEL0_3_REQSRC0_Msk     (0x7ful << LPPDMA_REQSEL0_3_REQSRC0_Pos)          /*!< LPPDMA_T::REQSEL0_3: REQSRC0 Mask      */

#define LPPDMA_REQSEL0_3_REQSRC1_Pos     (8)                                               /*!< LPPDMA_T::REQSEL0_3: REQSRC1 Position  */
#define LPPDMA_REQSEL0_3_REQSRC1_Msk     (0x7ful << LPPDMA_REQSEL0_3_REQSRC1_Pos)          /*!< LPPDMA_T::REQSEL0_3: REQSRC1 Mask      */

#define LPPDMA_REQSEL0_3_REQSRC2_Pos     (16)                                              /*!< LPPDMA_T::REQSEL0_3: REQSRC2 Position  */
#define LPPDMA_REQSEL0_3_REQSRC2_Msk     (0x7ful << LPPDMA_REQSEL0_3_REQSRC2_Pos)          /*!< LPPDMA_T::REQSEL0_3: REQSRC2 Mask      */

#define LPPDMA_REQSEL0_3_REQSRC3_Pos     (24)                                              /*!< LPPDMA_T::REQSEL0_3: REQSRC3 Position  */
#define LPPDMA_REQSEL0_3_REQSRC3_Msk     (0x7ful << LPPDMA_REQSEL0_3_REQSRC3_Pos)          /*!< LPPDMA_T::REQSEL0_3: REQSRC3 Mask      */

/** @} LPPDMA_CONST */
/** @} end of LPPDMA register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPPDMA_REG_H__ */
